Revit 2024 API
RevitLinkType.GetLinkedFileStatus Method
 Returns the LinkedFileStatus of this link.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.2
Syntax
C#
public LinkedFileStatus GetLinkedFileStatus()
Visual Basic
Public Function GetLinkedFileStatus As LinkedFileStatus
Visual C++
public:
LinkedFileStatus GetLinkedFileStatus()
See Also
RevitLinkType Class
Autodesk.Revit.DB Namespace